In [1]:
import tensorflow as tf
import matplotlib.pyplot as plt 
from sklearn.model_selection import train_test_split
from sklearn.compose import _column_transformer
from sklearn.preprocessing import OneHotEncoder,MinMaxScaler
import pandas as pd

In [2]:
dataset=pd.read_csv("https://raw.githubusercontent.com/FairozAhmadSheikh/Datasets_CSV/refs/heads/main/Customer%20Spending%20Score.csv")
dataset

     Gender  Age  Annual Income (k$)  Spending Score (1-100)
0      Male   19               15000                      39
1      Male   21               15000                      81
2    Female   20               16000                       6
3    Female   23               16000                      77
4    Female   31               17000                      40
..      ...  ...                 ...                     ...
195  Female   35              120000                      79
196  Female   45              126000                      28
197    Male   32              126000                      74
198    Male   32              137000                      18
199    Male   30              137000                      83

[200 rows x 4 columns]